#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВКМ_ЗаполнитьСписокДоговоров(Период) Экспорт

	ТаблицаДоговоров = Новый ТаблицаЗначений;
	ТаблицаДоговоров.Колонки.Добавить("ВКМ_Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТаблицаДоговоров.Колонки.Добавить("ВКМ_Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаДоговоров.Колонки.Добавить("ВКМ_Реализация", Новый ОписаниеТипов("ДокументСсылка.РеализацияТоваровУслуг"));
	ТаблицаДоговоров.Колонки.Добавить("ВКМ_Статус", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(120)));

	Если НЕ ЗначениеЗаполнено(Период) Тогда
		Возврат ТаблицаДоговоров;
	КонецЕсли;

	НачалоМесяцаПериода = НачалоМесяца(Период);
	КонецМесяцаПериода = КонецМесяца(Период);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Договоры.Ссылка КАК Договор,
	|	Договоры.Владелец КАК Контрагент
	|ПОМЕСТИТЬ ВТ_Договоры
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК Договоры
	|ГДЕ
	|	НЕ Договоры.ПометкаУдаления
	|	И Договоры.ВидДоговора = &ВидАбонентскогоДоговора
	|	И (Договоры.ВКМ_ДатаНачалаДействия = ДАТАВРЕМЯ(1, 1, 1)
	|		ИЛИ Договоры.ВКМ_ДатаНачалаДействия <= &КонецМесяца)
	|	И (Договоры.ВКМ_ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|		ИЛИ Договоры.ВКМ_ДатаОкончанияДействия >= &НачалоМесяца)
	|;
	|
	|ВЫБРАТЬ
	|	Реализации.Ссылка КАК Реализация,
	|	Реализации.Договор КАК Договор
	|ПОМЕСТИТЬ ВТ_Реализации
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Реализации
	|ГДЕ
	|	НЕ Реализации.ПометкаУдаления
	|	И Реализации.Договор В
	|		(ВЫБРАТЬ
	|			ВТ_Договоры.Договор
	|		ИЗ
	|			ВТ_Договоры)
	|	И НАЧАЛОПЕРИОДА(Реализации.Дата, МЕСЯЦ) = &НачалоМесяца
	|;
	|
	|ВЫБРАТЬ
	|	ВТ_Договоры.Договор КАК Договор,
	|	ВТ_Договоры.Контрагент КАК Контрагент,
	|	ВТ_Реализации.Реализация КАК Реализация
	|ИЗ
	|	ВТ_Договоры КАК ВТ_Договоры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Реализации КАК ВТ_Реализации
	|		ПО ВТ_Договоры.Договор = ВТ_Реализации.Договор
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Договоры.Контрагент";
	Запрос.УстановитьПараметр("ВидАбонентскогоДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяцаПериода);
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяцаПериода);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаДоговоров.Добавить();
		НоваяСтрока.ВКМ_Договор = Выборка.Договор;
		НоваяСтрока.ВКМ_Контрагент = Выборка.Контрагент;
		НоваяСтрока.ВКМ_Реализация = Выборка.Реализация;
		НоваяСтрока.ВКМ_Статус = ?(ЗначениеЗаполнено(Выборка.Реализация),
			НСтр("ru = 'Акт уже создан'"),
			НСтр("ru = 'Готов к созданию акта'"));
	КонецЦикла;

	Возврат ТаблицаДоговоров;

КонецФункции

#КонецОбласти

#КонецЕсли
