#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроведения(Отказ, Режим)

	СтрокиПремии = ВКМ_СтрокиПремииДляПроведения();
	Если СтрокиПремии.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не заполнен список сотрудников.'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Движения.ВКМ_НачисленияСотрудников.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;

	Для Каждого СтрокаПремии Из СтрокиПремии Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаПремии.Сотрудник) Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не заполнен сотрудник.'"));
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(СтрокаПремии.СуммаПремии) Или СтрокаПремии.СуммаПремии <= 0 Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Сумма премии должна быть больше нуля.'"));
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		НДФЛ = ВКМ_ОбслуживаниеКлиентов.ВКМ_РассчитатьНДФЛ(СтрокаПремии.СуммаПремии);
		СуммаКВыплате = СтрокаПремии.СуммаПремии - НДФЛ;

		ДвижениеПремии = Движения.ВКМ_НачисленияСотрудников.Добавить();
		ДвижениеПремии.Период = Дата;
		ДвижениеПремии.ВКМ_Сотрудник = СтрокаПремии.Сотрудник;
		ДвижениеПремии.ВКМ_ВидНачисления = НСтр("ru='Премия'");
		ДвижениеПремии.ВКМ_СуммаНачисления = СтрокаПремии.СуммаПремии;

		ДвижениеНДФЛ = Движения.ВКМ_НачисленияСотрудников.Добавить();
		ДвижениеНДФЛ.Период = Дата;
		ДвижениеНДФЛ.ВКМ_Сотрудник = СтрокаПремии.Сотрудник;
		ДвижениеНДФЛ.ВКМ_ВидНачисления = НСтр("ru='НДФЛ'");
		ДвижениеНДФЛ.ВКМ_СуммаНачисления = -НДФЛ;

		ДвижениеВзаиморасчетов = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		ДвижениеВзаиморасчетов.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеВзаиморасчетов.Период = Дата;
		ДвижениеВзаиморасчетов.ВКМ_Сотрудник = СтрокаПремии.Сотрудник;
		ДвижениеВзаиморасчетов.ВКМ_Сумма = СуммаКВыплате;
	КонецЦикла;

КонецПроцедуры

Функция ВКМ_СтрокиПремииДляПроведения()

	СтрокиПремии = Новый Массив;

	Если ВКМ_СписокСотрудников.Количество() > 0 Тогда
		Для Каждого СтрокаТЧ Из ВКМ_СписокСотрудников Цикл
			СтрокиПремии.Добавить(Новый Структура("Сотрудник, СуммаПремии",
				СтрокаТЧ.ВКМ_Сотрудник, СтрокаТЧ.ВКМ_СуммаПремии));
		КонецЦикла;
	ИначеЕсли ЗначениеЗаполнено(ВКМ_Сотрудник) Тогда
		СтрокиПремии.Добавить(Новый Структура("Сотрудник, СуммаПремии",
			ВКМ_Сотрудник, ВКМ_СуммаПремии));
	КонецЕсли;

	Возврат СтрокиПремии;

КонецФункции

#КонецЕсли
