#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроведения(Отказ, Режим)

	Если НЕ ЗначениеЗаполнено(ВКМ_Сотрудник) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не заполнен сотрудник.'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	// ВКМ_Изменение_Начало
	Если НЕ ЗначениеЗаполнено(ВКМ_СуммаПремии) Или ВКМ_СуммаПремии <= 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Сумма премии должна быть больше нуля.'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	// ВКМ_Изменение_Конец

	НДФЛ = ВКМ_ОбслуживаниеКлиентов.ВКМ_РассчитатьНДФЛ(ВКМ_СуммаПремии);
	СуммаКВыплате = ВКМ_СуммаПремии - НДФЛ;

	Движения.ВКМ_НачисленияСотрудников.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;

	ДвижениеПремии = Движения.ВКМ_НачисленияСотрудников.Добавить();
	ДвижениеПремии.ВидДвижения = ВидДвиженияНакопления.Приход;
	ДвижениеПремии.Период = Дата;
	ДвижениеПремии.ВКМ_Сотрудник = ВКМ_Сотрудник;
	ДвижениеПремии.ВКМ_ВидНачисления = НСтр("ru='Премия'");
	ДвижениеПремии.ВКМ_СуммаНачисления = ВКМ_СуммаПремии;

	ДвижениеНДФЛ = Движения.ВКМ_НачисленияСотрудников.Добавить();
	ДвижениеНДФЛ.ВидДвижения = ВидДвиженияНакопления.Приход;
	ДвижениеНДФЛ.Период = Дата;
	ДвижениеНДФЛ.ВКМ_Сотрудник = ВКМ_Сотрудник;
	ДвижениеНДФЛ.ВКМ_ВидНачисления = НСтр("ru='НДФЛ'");
	ДвижениеНДФЛ.ВКМ_СуммаНачисления = НДФЛ;

	ДвижениеВзаиморасчетов = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
	ДвижениеВзаиморасчетов.ВидДвижения = ВидДвиженияНакопления.Приход;
	ДвижениеВзаиморасчетов.Период = Дата;
	ДвижениеВзаиморасчетов.ВКМ_Сотрудник = ВКМ_Сотрудник;
	ДвижениеВзаиморасчетов.ВКМ_Сумма = СуммаКВыплате;

КонецПроцедуры

#КонецЕсли
