#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// ВКМ_Изменение_Начало
	ВКМ_НастроитьВидимостьРеквизитовАбонентскогоДоговора();
	// ВКМ_Изменение_Конец

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// ВКМ_Изменение_Начало
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)

	ВКМ_НастроитьВидимостьРеквизитовАбонентскогоДоговора();

КонецПроцедуры
// ВКМ_Изменение_Конец

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ВКМ_Изменение_Начало
&НаСервере
Процедура ВКМ_НастроитьВидимостьРеквизитовАбонентскогоДоговора()

	ЭтоАбонентскийДоговор = Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание;
	Элементы.ВКМ_ГруппаАбонентскоеОбслуживание.Видимость = ЭтоАбонентскийДоговор;

КонецПроцедуры
// ВКМ_Изменение_Конец

#КонецОбласти
